import { img } from "@data";
import { NewsInitType } from "./type";

export const news: NewsInitType = [
  {
    img: img.news1_img,
    title: "رمز ارز ملی: از رویا تا حقیقت!",
    desc: "به نقل از رئیس بانک مرکزی ایران در شهریور ۱۴۰۱ از رمز ارز ریال رونمایی خواهد شد. این رونمایی در جهت هوشمندسازی ریال ایران",
    author: "سید حسین یعقوبی",
    date: "1402/06/13",
    view: 250,
  },
  {
    img: img.news2_img,
    title: "ارز دیجیتال چیست؟!",
    desc: "ارز دیجیتال یک نوع پول مجازی است که امنیت آن از طریق رمزنگاری تامین می‌شود و مهم‌ترین  است. غیرمتمرکز بودن به این معنی است...",
    author: "سینا امجدی",
    date: "1402/06/13",
    view: 250,
  },
  {
    img: img.news3_img,
    title: "ارتباط ارز دیجیتال و بلاکچین",
    desc: "فناوری بلاکچین کاربردهای بالقوه زیادی دارد که تنها یکی از آن‌ها در ارزهای دیجیتال است. بلاکچین یک دفتر کل توزیع شده یا به ...",
    author: "سارا اخذری",
    date: "1402/02/17",
    view: 135,
  },
  {
    img: img.news4_img,
    title: "تفاوت ارز دیجیتال با پول فیات!",
    desc: "ارزهای دیجیتال مانند ارزهای فیات در قالب اسکناس یا سکه وجود ندارند. در عوض، آن‌ها تنها در یک شبکه مجازی رمزنگاری‌شده ...",
    author: "سهیل محبوبی",
    date: "1401/06/08",
    view: 269,
  },
  {
    img: img.news5_img,
    title: "سازوکار تولید ارز دیجیتال چیست؟",
    desc: "بیت کوین به عنوان نخستین ارز دیجیتال، در فرآیندی به نام ماینینگ یا استخراج ایجاد می‌شود که مانند عملیات استخراج در معادن واقعی ...",
    author: "مینا محبی",
    date: "1401/09/02",
    view: 234,
  },
  {
    img: img.news6_img,
    title: "قیمت ارز دیجیتال چطور تعیین می‌شود؟",
    desc: "قیمت ارزهای دیجیتال همواره با نوسان همراه است. به همین دلیل است که پیش‌بینی قیمت رمزارزها برای معامله‌گران بسیار اهمیت دارد ...",
    author: "سید حسین یعقوبی",
    date: "1400/01/20",
    view: 345,
  },
  {
    img: img.news7_img,
    title: "دلایل محبوبیت ارزهای دیجیتال",
    desc: "به نقل از رئیس بانک مرکزی ایران در شهریور ۱۴۰۱ از رمز ارز ریال رونمایی خواهد شد. این رونمایی در جهت هوشمندسازی ریال ایران",
    author: "سید حسین یعقوبی",
    date: "1402/06/13",
    view: 250,
  },
  {
    img: img.news8_img,
    title: "رمز ارز ملی: از رویا تا حقیقت!",
    desc: "هر چند در ابتدا مردم نسبت به بیت کوین و سایر ارزهای دیجیتال، بی اعتماد بودند اما با گذشت زمان و بهبود فناوری‌های استفاده شده در ...",
    author: "زهرا شرقی",
    date: "1402/01/20",
    view: 435,
  },
];
